app/views/users/show.html.erb

	<div class="span8">
		<% if @user.posts.any? %>
---
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = 1