app/views/posts/index.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = 1
---
<p style="margin-bottom:10px"><b>By <%=link_to p.user.name,p.user %></b></p>
<p style="margin-bottom:10px;"><b>Comments: <i class="icon-comment"></i> <%= p.comments.count %></b></p>