app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY created_at DESC LIMIT 1  [["id", "1"]]
---
  def show
  	@post=Post.find(params[:id])

INSERT INTO "posts" ("body", "created_at", "photo_content_type", "photo_file_name", "photo_file_size", "photo_updated_at", "showpost", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
  	#@post=Post.new(params[:post])
    @post=current_user.posts.build(params[:post])
  	if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY created_at DESC LIMIT 1  [["id", "5"]]
---
  def edit
  	if signed_in?
  	@post=Post.find(params[:id])

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY created_at DESC LIMIT 1  [["id", "5"]]
---
  def update
  	@post=Post.find(params[:id])

SELECT "posts".* FROM "posts" ORDER BY created_at DESC LIMIT 3 OFFSET 0
SELECT COUNT(*) FROM "posts"
---
  def index
  	@posts=Post.paginate(page: params[:page],:per_page => 3,:order=>'created_at DESC')