app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = 1 ORDER BY created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = 1
---
  def show
  	@user=User.find(params[:id])
    @posts=@user.posts.paginate(page:params[:page])

INSERT INTO "users" ("admin", "created_at", "email", "name", "password_digest", "photo_content_type", "photo_file_name", "photo_file_size", "photo_updated_at", "remember_token", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
  	@user=User.new(params[:user])
  	if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "users" SET "password_digest" = '$2a$10$Plep9jj0T58tL4zV6INoFu1yjbUJgl1vALXqT7nTb2JWp9cV693xq', "photo_file_name" = 'vivek123.jpg', "photo_content_type" = 'image/jpeg', "photo_file_size" = 329926, "photo_updated_at" = '2013-07-05 21:35:56.406250', "remember_token" = 'RNq-GOsEAr-q9RgoJptJ2Q', "updated_at" = '2013-07-05 21:35:56.421875' WHERE "users"."id" = 1
---
  def update
    @user=User.find(params[:id])
    if @user.update_attributes(params[:user])

SELECT "users".* FROM "users" ORDER BY name ASC LIMIT 3 OFFSET 0
SELECT COUNT(*) FROM "users"
---
  def index
    @users = User.paginate(page: params[:page],:per_page => 3, :order => 'name ASC')