app/views/layouts/_commentsadd.html.erb

<h2 style="text-align:left">Comments:</h2>
<% @post.comments.reverse.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 1